import shutil
import os

# 原始目錄
source_dir = r'I:\快看\[ok]'
# 目標目錄
target_dir = r'I:\快看\[ok]\ok'

# 需要移動的子目錄列表
subdirectories = [
    "哪里来的大宝贝", "破云2：吞海", "我打造了长生俱乐部", "30岁男子物语", "与子成契", "心头肉", "妻为上", "蛊蝶",
    "双面总裁宠妻指南", "我！天命大反派", "明日星程", "我是无敌大天才", "你却爱着一个他", "DOLO命运胶囊", "超凡进化", "随心",
    "即使是日常", "前无古人", "奥格斯的法则", "育才仙宗", "敏感", "春日将至", "我家保镖1米3", "不乖", "总有妖怪想抓我",
    "我们三分熟", "天才画师小娘子", "大医凌然", "疯狂升级系统", "这一世我要当至尊", "被自己束缚的金丝雀", "少年纪事", "君面似桃花",
    "诟病", "从渡劫开始", "非正常偶像", "今日晴朗，局部掉龙！", "从末世崛起", "最强玩家", "狼的谎言", "社畜魔女谈恋爱真难",
    "听见银河落下的声音", "公主病的克星-《感谢你是爱我的》系列2", "莫吉托", "Soulmate", "面具姐妹", "柒x二十四时", "初恋是男孩子",
    "触不可及", "我在1999等你", "你曾经爱我", "水蓝色棋盘", "拴好我的狼", "岂止钟情", "将军，小心恶犬！", "小心被梦魔吃掉哦",
    "闪婚总裁契约妻", "道士X契约妖", "哑奴", "再度与你", "刻在眉眼间", "名门挚爱", "披着狼皮的羊", "人鱼的裙摆",
    "爱情的样子：心之所向", "花与隐匿之乌", "穿越成反派要如何活命", "甜美的咬痕", "垫底魔女", "今天的她也是如此可爱",
    "年年有鱼了", "回到黎明前", "极品废材小姐", "《妃为九卿》-神医小娇妃", "过度接触", "养敌为患", "以唇封缄",
    "引狼入室", "那个男人让我无法拒绝", "王子与他的黑月光", "贫穷公主掠夺计划_ThePreysHuntingGame", "饲狼法则_PrincipleofWolfFeeding",
    "与爱有关", "女仆驾到", "首席的独家宠爱_MyBossWontStopLovingMe", "未曾知晓的那一日_SomedayINeverKnew", "日日动人_LoveYouEveryday",
    "您的亿万首席请签收_AccidentalLove", "沈升", "诛心之罪", "他的夫人超大牌", "殿下求你别作妖", "花开未满", "不可爱的TA",
    "渐进的心跳", "沉溺于你的光芒", "逃不掉的千亿蜜爱", "女巨人也要谈恋爱", "昼夜连绵", "表面关系男团", "现代魔男狩猎计划",
    "非友人关系", "逆风之花", "十二点的灰姑娘", "今夜晚风吹拂", "快穿女配冷静点", "鲛人崽崽三岁啦", "她又又又上热搜啦",
    "我能复制天赋", "掌上萌珠", "社畜名媛在线营业", "我把男主和反派都养歪了", "有本事你再凶一个？", "只有恋爱才能防止黑化",
    "她真漂亮"
]

# 遍歷子目錄並移動
for subdir in subdirectories:
    source_path = os.path.join(source_dir, subdir)
    target_path = os.path.join(target_dir, subdir)

    # 檢查原始目錄是否存在
    if os.path.exists(source_path):
        # 移動目錄
        shutil.move(source_path, target_path)
        print(f"已成功移動 {subdir} 到 {target_dir}")
    else:
        print(f"目錄不存在: {source_path}")
